{
  "posts": [
    {
      "userId": "1",
      "id": 1,
      "title": "Canada Serial Killer, Who Would Feed Victims To Pigs, Killed In Prison",
      "image": "https://c.ndtvimg.com/2024-06/t7i6b6e8_robert-pickton-_625x300_01_June_24.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180",
      "body": " a fantasy novel written by British author J. K. Rowling. The first novel in the Harry Potter series and Rowling's debut novel follows Harry Potter, a young wizard who discovers his magical heritage on his eleventh birthday when he receives a letter of acceptance to Hogwarts School of Witchcraft and Wizardry."
    },
    {
      "userId": "1",
      "id": 2,
      "title": "Viral Video Of \"Nonna\" Feeding WFH Grandchild Lots Of Food Wins Internet",
      "image": "https://c.ndtvimg.com/2024-05/9lfdn9e8_viral-video-of-nonna-keeping-wfh-grandchild-wellfed-wins-internet_120x90_30_May_24.jpg",
      "body": "Viral video of the day: A video showing an Italian grandmother bringing many dishes for her grandchild working from home has won many hearts online."
    },
    {
      "userId": "1",
      "id": 3,
      "title": "Here's Why US Wildlife Centre Staff Wears Fox Mask While Feeding Newborn",
      "image": "https://c.ndtvimg.com/2024-03/1fcbd4f_richmond-wildlife-center-fox-facebook_625x300_15_March_24.jpeg",
      "body": "Employees at Virginia's Richmond Wildlife Center have come up with a unique way to stop an abandoned newborn red fox from becoming too familiar with humans."
    },
    {
      "userId": "1",
      "id": 4,
      "title": "Watch: Kartik Aaryan Wraps Chandu Champion, Eats Sugar After 1 Year In His Favourite Sweet",
      "image": "https://c.ndtvimg.com/2024-01/j75c9soo_kartik-aaryan-_640x480_29_January_24.jpg?im=FaceCrop,algorithm=dnn,width=345,height=250",
      "body": "The now-viral clip begins with Kabir Khan feeding Kartik Aaryan his favourite dessert while the actor admits he will feel guilty about it."
    },
    {
      "userId": "1",
      "id": 5,
      "title": "Watch: Rats Spotted Feeding On Food At IRCTC Stall, Railways Responds",
      "image": "https://c.ndtvimg.com/2024-01/e5ffo33_irctc_625x300_09_January_24.jpg?im=FeatureCrop,algorithm=dnn,width=345,height=250",
      "body": "Reportedly, the footage was from Madhya Pradesh's Itarsi Junction railway station. Official RailwaySeva handle responded to the post, assuring immediate actions will be taken."
    },
    {
      "userId": "1",
      "id": 6,
      "title": "Ayodhya Gears Up To Feed Lakhs Of Devotees On Jan 22, With A Little Help",
      "image": "https://c.ndtvimg.com/2024-01/20c0akr8_ayodhya-ram-mandir-idol_120x90_02_January_24.jpg",
      "body": "In an exemplary show of solidarity, people from across the country are sending vegetables, rice and other food items to Ayodhya as a contribution for the grand consecration ceremony on January 22."
    },
    {
      "userId": "1",
      "id": 7,
      "title": "Watch: Content Creator Orders Food For Hungry Family, Wins Hearts Online",
      "image": "https://c.ndtvimg.com/2023-12/ie5039lo_content-creator-pays-for-meal-for-family-in-need_120x90_22_December_23.jpg",
      "body": "A viral video shows a popular content creator, Mohamed Ashik, feeding a needy family food at a restaurant."
    },
    {
      "userId": "1",
      "id": 8,
      "title": "Viral Video Shows Flight Attendant Spoon-Feeding 5-Year-Old Passenger, Internet Divided",
      "image": "https://c.ndtvimg.com/2023-12/17ipqn4o_flight-attendant-spoonfeeds-kid-viral-video_120x90_09_December_23.jpg",
      "body": "Onboard a Singapore Airlines flight to Tokyo, a viral video shows a flight attendant helping a child with their meal."
    },
    {
      "userId": "1",
      "id": 9,
      "title": "Viral Video: Istanbul's Chef Cooks Up A Storm For Stray Cat, Internet Can't Get Enough",
      "image": "https://c.ndtvimg.com/2023-11/31h97qfo_turkish-chef_120x90_10_November_23.jpg",
      "body": "This Istanbul chef goes viral for cooking up a storm... for a stray cat!"
    },
    {
      "userId": "1",
      "id": 10,
      "title": "This Single Egg Can Feed A Family Of 5-6 Members. Confused? Read On",
      "image": "https://c.ndtvimg.com/2023-08/pe5o5rm_emu-egg-video_625x300_31_August_23.jpg?im=FaceCrop,algorithm=dnn,width=345,height=250",
      "body": "The video shows a large emu egg being cracked and cooked."
    },
    {
      "userId": "1",
      "id": 11,
      "title": "As Cyclone Biparjoy Nears, Villagers Return To Coast To Feed Their Pets",
      "image": "https://c.ndtvimg.com/2023-06/ngd08l2o_gujarat-villager-with-petscyclone-biparjoy_120x90_15_June_23.jpg",
      "body": "Nearly one lakh people have been shifted to shelters in Gujarat as the western state braces for cyclone Biparjoy, which is expected to make landfall this evening."
    },
    {
      "userId": "1",
      "id": 12,
      "title": "Gigi Hadid Shares Pics Of Baby Girl Khai's Meals - Full Of Colours, Shapes And Nutrients",
      "image": "https://c.ndtvimg.com/2023-05/5j09llt_gigi-hadid-with-baby-khai_625x300_16_May_23.jpg?im=FeatureCrop,algorithm=dnn,width=345,height=250",
      "body": "Gigi Hadid shared a photo dump of baby food she fed her little girl on various occasions, and we were left impressed."
    },
    {
      "userId": "1",
      "id": 13,
      "title": "Your Twitter Feed Will Look Different As Elon Musk Confirms This Change",
      "image": "https://c.ndtvimg.com/2022-11/b0bp38l_elon-musk-twitter-blue-tick-afp-240_120x90_10_November_22.jpg",
      "body": "Elon Musk has implemented a number of changes since buying Twitter for $44 billion in November last year."
    },
    {
      "userId": "1",
      "id": 14,
      "title": "IPL 2023 : Virat Kohli, Faf du Plessis Are Going To Feed Off Each Other Perfectly: Chris Gayle",
      "image": "https://c.ndtvimg.com/2023-04/k9b222cg_virat-kohli_625x300_03_April_23.jpg?im=FaceCrop,algorithm=dnn,width=240,height=180",
      "body": "Virat Kohli and skipper Faf du Plessis put on a stellar show for the opening wicket against MI, compiling 148 runs, as RCB romped home in only 16.2 overs."
    },
    {
      "userId": "1",
      "id": 15,
      "title": "Pics: PM Modi Feeds Cows At His Residence On Makar Sankranti",
      "image": "https://c.ndtvimg.com/2024-01/tsups0q_pm-modi-feeds-cows_625x300_14_January_24.jpeg?im=FaceCrop,algorithm=dnn,width=240,height=180",
      "body": "In a photo, the Prime Minister can be seen surrounded by cows."
    },
    {
      "userId": "1",
      "id": 16,
      "title": "Woman Allegedly Kills Boyfriend's Child By Feeding Her Screws, Batteries",
      "image": "https://c.ndtvimg.com/2024-01/m0jnir58_us-woman-kills-baby_625x300_14_January_24.jpeg",
      "body": "A woman in the US state of Pennsylvania has been accused of fatally poisoning her boyfriend's toddler by feeding her batteries, screws and nail polish remover."
    },
    {
      "userId": "1",
      "id": 17,
      "title": "US Woman, 38, Mauled To Death While Feeding Neighbour's Dogs",
      "image": "https://c.ndtvimg.com/2023-03/80lkujf_great-dane-generic_120x90_20_March_23.jpg",
      "body": "A woman in the United States was mauled to death by her neighbour's dogs when she went over to feed them when the owner was away."
    },
    {
      "userId": "1",
      "id": 18,
      "title": "Reddit Updated With Ability to Search Within Post Comments, News Feeds and More: All Details",
      "image": "https://i.gadgets360cdn.com/large/reddit_discover_tab_feature_website_small_1645768334920.jpg",
      "body": "Reddit has introduced several new features to let people engage in conversations, discover and contribute content in an easy and simple way. The social media platform has added the ability to search within post comments along with a dedicated video feed and a decluttered interface."
    },
    {
      "userId": "1",
      "id": 19,
      "title": "Feeding Of Fake Notes In Coin Vending Machines Led To UPI-Based Alternative: RBI",
      "image": "https://c.ndtvimg.com/2023-02/h0f16tek_atm-generic_120x90_08_February_23.jpg",
      "body": "Getting fake currency notes in coin vending machines led the Reserve Bank to announce the unified payment system-based alternative, Deputy Governor T Rabi Sankar said on Wednesday."
    }
  ]
}
